# SPDX-FileCopyrightText: 2019 Emil Lundmark <emil@lndmrk.se>
# SPDX-License-Identifier: GPL-3.0-or-later
#+TITLE: lndmrk's Emacs Configuration
#+AUTHOR: Emil Lundmark

*** modus-theme

#+begin_src emacs-lisp
(use-package modus-themes
  :ensure t
  :init
  (modus-themes-load-themes)
  :custom
  (modus-themes-lang-checkers '(intense))
  (modus-themes-hl-line '(intense))
  (modus-themes-mode-line '(borderless))
  (modus-themes-org-blocks 'gray-background)
  (modus-themes-paren-match '(bold))
  (modus-themes-region '(no-extend))
  (modus-themes-subtle-line-numbers t)
  (modus-themes-vivendi-color-overrides
   '((bg-main . "#171717")
     (bg-dim . "#202020")
     (bg-alt . "#272727")
     (bg-active . "#3C3C3C")
     (bg-inactive . "#2A2A2A")
     (bg-hl-line . "#262626")
     (bg-hl-line-intense . "#343434")))
  :config
  (modus-themes-load-vivendi))
#+end_src

The =bg-main= color have been overridden to match my terminal background color.
Other background colors have been adjusted accordingly to retain the contrast
ratio.

| bg-main            |         | #000000 | #171717 |
|--------------------+---------+---------+---------|
| bg-dim             | #100F10 |    1.10 |         |
| bg-alt             | #191A1B |    1.20 |         |
| bg-active          | #323232 |    1.64 |         |
| bg-inactive        | #1E1E1E |    1.26 |         |
| bg-hl-line         | #151823 |    1.19 |         |
| bg-hl-line-intense | #292929 |    1.44 |         |
|--------------------+---------+---------+---------|
| bg-dim             | #202020 |         |    1.10 |
| bg-alt             | #272727 |         |    1.20 |
| bg-active          | #3C3C3C |         |    1.63 |
| bg-inactive        | #2A2A2A |         |    1.25 |
| bg-hl-line         | #262626 |         |    1.18 |
| bg-hl-line-intense | #343434 |         |    1.44 |
#+tblfm: @2$3..@7$3='(modus-themes-contrast @1$3 $2);%0.2f::@8$4..@13$4='(modus-themes-contrast @1$4 $2);%0.2f

